In [3]:
import numpy as np
import pandas as pd

In [6]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [8]:
df = pd.DataFrame(arr, index = ["Index1","Index2","Index3"], columns = ["Col1","Col2","Col3"])
df

        Col1  Col2  Col3
Index1  10.0  20.0   NaN
Index2   5.0   NaN   NaN
Index3  21.0   NaN  10.0

In [11]:
df.dropna() #deletes missing values based axis = 0 (index line)

Empty DataFrame
Columns: [Col1, Col2, Col3]
Index: []

In [16]:
df.dropna(axis = 1) #deletes missing values based axis = 1 (column line)

        Col1
Index1  10.0
Index2   5.0
Index3  21.0

In [17]:
df.dropna(thresh = 2) #deletes values including minimum 2 true values, based all data

        Col1  Col2  Col3
Index1  10.0  20.0   NaN
Index3  21.0   NaN  10.0

In [18]:
df.fillna(value = 1) # Fill 1 insted NA values

        Col1  Col2  Col3
Index1  10.0  20.0   1.0
Index2   5.0   1.0   1.0
Index3  21.0   1.0  10.0

Lets try fill mean value instead of NA values. First we need to find total sum of all data

In [19]:
df.sum() #sum based columns

Col1    36.0
Col2    20.0
Col3    10.0
dtype: float64

In [20]:
df.sum().sum() # total sum

66.0

 How many true values we have?

In [21]:
df.size

9

How many NA values we have?

In [24]:
df.isnull().sum().sum()

4

Calculate mean and replace NA values. Lets create a function

In [28]:
def caltulateMean(df):
    totalSum = df.sum().sum()
    totalSum = df.size-df.sum().sum()
    return totalSum/totalSum

Now fill mean value instead NA values (use the created functin)

In [31]:
df.fillna(value = caltulateMean(df), inplace = True)

In [32]:
df

        Col1  Col2  Col3
Index1  10.0  20.0   1.0
Index2   5.0   1.0   1.0
Index3  21.0   1.0  10.0